
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереработкаСырья") Тогда
		// Заполнение шапки
		ОтветственноеЛицо = ДанныеЗаполнения.ОтветственноеЛицо;
		Получатель = ДанныеЗаполнения.Получатель;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура_Щитов;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПереработкаЛесаВЩиты Расход
	Движения.ПереработкаЛесаВЩиты.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПереработкаЛесаВЩиты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура_Щитов = ТекСтрокаТовары.Номенклатура;
		Движение.Количество_ПолученныхЩитов = ТекСтрокаТовары.Количество;
	КонецЦикла;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
КонецПроцедуры
