
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорыСКонтрагентами.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыСКонтрагентами.БанковскийСчетПокупателя,
	|	ДоговорыСКонтрагентами.БанковскийСчетПоставщика,
	|	ДоговорыСКонтрагентами.Дата,
	|	ДоговорыСКонтрагентами.ДатаЗаключения,
	|	ДоговорыСКонтрагентами.Комментарий,
	|	ДоговорыСКонтрагентами.КонтрагентПокупатель,
	|	ДоговорыСКонтрагентами.КонтрагентПоставщик,
	|	ДоговорыСКонтрагентами.Номер,
	|	ДоговорыСКонтрагентами.РабочееНаименование,
	|	ДоговорыСКонтрагентами.Статус,
	|	ДоговорыСКонтрагентами.Тип
	|ИЗ
	|	Документ.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
	|ГДЕ
	|	ДоговорыСКонтрагентами.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
