

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр             = "Файлы Excel (*.xls, *.xlsx)|*.xl*";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь к файлу для загрузки");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ТекДок = Новый ТекстовыйДокумент;
	ТабДокСлуж = Новый ТабличныйДокумент;
	
	ВхДанные = Новый Структура();
	ВхДанные.Вставить("НомерПервойСтроки", НомерПервойСтроки);
	ВхДанные.Вставить("НомерПоследнейСтроки", НомерПоследнейСтроки);
	ВхДанные.Вставить("ПрерватьПриОшибке", ПрерватьПриОшибке);
	ВхДанные.Вставить("Номенклатура", Номенклатура);
	ВхДанные.Вставить("Цена", Цена);
	ВхДанные.Вставить("Элемент", Элемент);
	ВхДанные.Вставить("Элемент1", Элемент1);
	ВхДанные.Вставить("Элемент2", Элемент2);
	ВхДанные.Вставить("Элемент3", Элемент3);
	ВхДанные.Вставить("Элемент4", Элемент4);
    Результат = Новый ТабличныйДокумент;
	Результат = ЗаполнитьНаСервереМО(ТаблицаФорма, ВхДанные, ТекДок);
	//Результат.Показать();
	
	Сообщить("Загрузка выполнена!");
КонецПроцедуры

&НаКлиенте
Процедура ПослеОшибки(Результат) Экспорт
КонецПроцедуры // ПослеОшибки()

&НаСервере
Функция ЗаполнитьНаСервереМО(ТабДок, ВхДанные, ТекДок)
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = Об.ЗаполнитьНаСервере(ТабДок, ВхДанные, ТекДок);	
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьНаСервереМО()

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
		
	
КонецПроцедуры // УправлениеВидимостью()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Метаданные.ФункциональныеОпции.Найти("ИспользоватьХарактеристикиНоменклатуры") <> Неопределено Тогда
		ИмяФО = "ИспользоватьХарактеристикиНоменклатуры";
	Иначе
		ИмяФО = "ИспользоватьХарактеристики";
	КонецЕсли;
	//ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите файл загрузки (Excel или DBF)"; 	
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("Обработчик_Завершения_Загрузки", ЭтотОбъект, Диалог); 	
	НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Завершения_Загрузки(Результат, Адрес, ПомещаемыйФайл, Параметры) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Если Прав(ПомещаемыйФайл,4) = "xlsx" Тогда
		Расширение = "xlsx";
	ИначеЕсли Прав(ПомещаемыйФайл,4) = ".xls" Тогда
		Расширение = "xls";
	ИначеЕсли НРЕГ(Прав(ПомещаемыйФайл,4)) = ".dbf" Тогда
		Расширение = "dbf";
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТабДокСервер(Адрес, Расширение);			
	
КонецПроцедуры // Обработчик_Завершения_Загрузки()

&НаСервере
Процедура ЗаполнитьТабДокСервер(АдресВХ, Расширение)
	
	ТаблицаФорма.Очистить();
	Если Расширение = "dbf" Тогда
		ИмяФайла = КаталогВременныхФайлов() + "1.dbf";
	Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	КонецЕсли;
	ДвДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	ДвДанные.Записать(ИмяФайла);
	
	Если Расширение = "dbf" Тогда
		
		Таблица = Новый XBase;
		Таблица.Кодировка = КодировкаXBase.OEM;
		Таблица.ОткрытьФайл(
		ИмяФайла, // путь к базе
		, // путь к индексу
		Истина // только чтение
		);
		
		//Выводим заголовок
		НомерКолонки = 1;
		НомерСтроки = 1;
		Для каждого ПолеТаблицы из Таблица.поля Цикл
			
			ТаблицаФорма.Область(НомерСтроки, НомерКолонки).Текст = ПолеТаблицы.Имя;
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
		НомерСтроки = 2;
		Таблица.Первая(); // перешли к первой записи
		Пока Не Таблица.ВКонце() Цикл
			
			НомерКолонки = 1;
			Если Не Таблица.ЗаписьУдалена() Тогда
				
				Счетчик = Формат(НомерСтроки, "ЧГ=0");
				Для каждого ПолеТаблицы из Таблица.поля Цикл
					ТаблицаФорма.Область(Счетчик, НомерКолонки).Текст = Таблица[ПолеТаблицы.Имя];
					НомерКолонки = НомерКолонки + 1;
				КонецЦикла;
				
			КонецЕсли;
			Таблица.Следующая(); // переходим к следующей записи
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		Таблица.ЗакрытьФайл();
		УдалитьФайлы(ИмяФайла);
		
	Иначе
		ТаблицаФорма.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТабДокСервер()
