&НаКлиенте
Процедура СортПриИзменении(Элемент)
	ОбновитьЩит();
КонецПроцедуры
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ОбновитьЩит();
КонецПроцедуры
&НаКлиенте
Процедура ДлинаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКВ();
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура ШиринаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКВ(); 
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура ТолщинаВММПриИзменении(Элемент)
	ОбновитьЩит();
	МетрКуб();
КонецПроцедуры
&НаКлиенте
Процедура  ОбновитьЩит()
	        Объект.Наименование= Строка (Формат((Объект.Сорт), "ЧГ=")) + " " + Строка (Формат((Объект.Тип), "ЧГ=")) + " " + Строка (Формат((Объект.ДлинаВММ), "ЧГ=")) + "*" + Строка (Формат((Объект.ШиринаВММ), "ЧГ=")) + "*" + Строка (Формат((Объект.ТолщинаВММ), "ЧГ="));
КонецПроцедуры
&НаКлиенте
Процедура МетрКВ()
	   Объект.МетрКвадратный= (Строка (Формат((Объект.ДлинаВММ), "ЧГ="))*Строка (Формат((Объект.ШиринаВММ), "ЧГ=")))/1000000;
КонецПроцедуры
&НаКлиенте
Процедура МетрКуб()
	   Объект.МетрКубический= (Строка (Формат((Объект.ДлинаВММ), "ЧГ="))*Строка (Формат((Объект.ШиринаВММ), "ЧГ="))*Строка (Формат((Объект.ТолщинаВММ), "ЧГ=")))/1000000000;
КонецПроцедуры
&НаКлиенте
Процедура ЭлПодписьПриИзменении(Элемент)
	Если Объект.ЭлПодпись = Истина Тогда
		Элементы.Материалы.Доступность=Ложь;
		Элементы.ОтветственноеЛицоСпецификации.Доступность=Ложь;
	Иначе
		Элементы.Материалы.Доступность=Истина;
		Элементы.ОтветственноеЛицоСпецификации.Доступность=Истина;
	КонецЕсли;
КонецПроцедуры



