
&НаСервере
Процедура ЗаполнитьПоСпецификациямНаСервере()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Номенклатура_Щитов КАК Номенклатура,
	               |	Товары.Количество
	               |ПОМЕСТИТЬ ТЧТовары
	               |ИЗ
	               |	&Товары КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДеревянныеЩиты_НоменклатураМатериалы.Номенклатура КАК Номенклатура_Леса,
	               |	СУММА(ДеревянныеЩиты_НоменклатураМатериалы.Количество * ЕСТЬNULL(ТЧТовары.Количество, 0)) КАК Количество
	               |ИЗ
	               |	ТЧТовары КАК ТЧТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДеревянныеЩиты_Номенклатура.Материалы КАК ДеревянныеЩиты_НоменклатураМатериалы
	               |		ПО ТЧТовары.Номенклатура = ДеревянныеЩиты_НоменклатураМатериалы.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДеревянныеЩиты_НоменклатураМатериалы.Номенклатура";               
	Запрос.УстановитьПараметр("Товары",Объект.Товары.Выгрузить());
	Объект.Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификациям(Команда)
	ЗаполнитьПоСпецификациямНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ГруппаТовары.Заголовок = "Товары ("+Объект.Товары.Количество()+")";
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ГруппаМатериалы.Заголовок = "Материалы ("+Объект.Материалы.Количество()+")";
КонецПроцедуры
