
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиМатериаловИТоваров Расход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалы.Номенклатура_Леса;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	// регистр ПереработкаЛесаВЩиты Приход
	Движения.ПереработкаЛесаВЩиты.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ПереработкаЛесаВЩиты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура_Леса = ТекСтрокаМатериалы.Номенклатура_Леса;
		Движение.Количество_Леса = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	// регистр ПереработкаЛесаВЩиты Расход
	Движения.ПереработкаЛесаВЩиты.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ПереработкаЛесаВЩиты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура_Леса = ТекСтрокаМатериалы.Номенклатура_Леса;
		Движение.Количество_Леса = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	// регистр ПереработкаЛесаВЩиты Приход
	Движения.ПереработкаЛесаВЩиты.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПереработкаЛесаВЩиты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура_Щитов = ТекСтрокаТовары.Номенклатура_Щитов;
		Движение.Количество_ПолученныхЩитов = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Материалы;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.КоличествоКт = ТекСтрокаТовары.Количество;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТовары.Номенклатура_Щитов;
		    Для Каждого ТекСтрокаТовары Из Материалы Цикл
				Движение.КоличествоДт = ТекСтрокаТовары.Количество;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТовары.Номенклатура_Леса;
		   КонецЦикла;	
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
