Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    	// регистр ОстаткиМатериаловИТоваров Расход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина; 
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	ТорговляЩитамиТовары.Номенклатура_Щита,
	|	СУММА(ТорговляЩитамиТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДокТЧС
	|ИЗ
	|	Документ.ТорговляЩитами.Товары КАК ТорговляЩитамиТовары
	|ГДЕ
	|	ТорговляЩитамиТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТорговляЩитамиТовары.Номенклатура_Щита
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧС.Номенклатура_Щита,
	|	ДокТЧС.Количество
	|ИЗ
	|	ДокТЧС КАК ДокТЧС";  
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Щита;
		Движение.Помещение = Помещение;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Помещение И Номенклатура В (Выбрать ДокТЧС.Номенклатура_Щита ИЗ ДокТЧС КАК ДокТЧС)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	
	 Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало товара "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТовары.Номенклатура_Щита;
	КонецЦикла;
	
	// регистр РегистрВзаиморасчетов Приход
	Движения.РегистрВзаиморасчетов.Записывать = Истина;
	Движение = Движения.РегистрВзаиморасчетов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация; 
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;

КонецПроцедуры
