
&НаКлиенте
Процедура ПеремещениеТовараПриИзменении(Элемент)
	Если Объект.ПеремещениеТовара = Истина Тогда
		Элементы.ПеремещениеМатериала.Видимость=Ложь;
		Элементы.ТоварыДляПеремещения.Видимость = Истина;
	Иначе
		Элементы.ТоварыДляПеремещения.Видимость = Ложь;
		Элементы.ПеремещениеМатериала.Видимость=Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеМатериалаПриИзменении(Элемент)
	Если Объект.ПеремещениеМатериала = Истина Тогда
		Элементы.ПеремещениеТовара.Видимость=Ложь;
		Элементы.МатериалыДляПеремещения.Видимость = Истина;
	Иначе
		Элементы.МатериалыДляПеремещения.Видимость = Ложь;
		Элементы.ПеремещениеТовара.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)	
	Если Объект.Отправитель = ПредопределенноеЗначение("Справочник.Помещения.Производство") Тогда
        Объект.Получатель = ПредопределенноеЗначение("Справочник.Помещения.СкладЩитов");
	КонецЕсли;	
	Если Объект.Отправитель = ПредопределенноеЗначение("Справочник.Помещения.СкладСырья") Тогда
        Объект.Получатель = ПредопределенноеЗначение("Справочник.Помещения.Производство");
	КонецЕсли;
КонецПроцедуры



