 Процедура ПроведениеПоступленийИзПереработкив18_00() Экспорт 
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТовараИзПереработки.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТовараИзПереработки КАК ПоступлениеТовараИзПереработки
	               |ГДЕ
	               |	ПоступлениеТовараИзПереработки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И НЕ ПоступлениеТовараИзПереработки.Проведен";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл	
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
 КонецПроцедуры
  