
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	// СтрокаТабличнойЧасти.Цена= РаботаСоСправочниками.ЦенаЗакупки(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.Товары.Заголовок = "Материалы ("+Объект.Материалы.Количество()+")";
КонецПроцедуры

