
&НаКлиенте
Процедура ТоварыНоменклатура_ЩитаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена= РаботаСоСправочниками.ЦенаЗакупки(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура_Щита);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСуммуТорговля(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСуммуТорговля(СтрокаТабличнойЧасти);
КонецПроцедуры
