
Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ОстаткиМатериаловИТоваров.Записывать = Истина; 
	
	ИспользоватьПоСкладам = ПолучитьФункциональнуюОпцию("ПоСкладам");
	
	ТЗ = Материалы.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "КоличествоМат, Сумма");
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Если ИспользоватьПоСкладам Тогда
		Движение.Помещение = Помещение;
		КонецЕсли;
		Движение.Количество = ТекСтрокаТовары.КоличествоМат;
	КонецЦикла;

	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл	
	// Регистр Управленческий 
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Материалы;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.КоличествоМат;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТовары.Номенклатура;	
	КонецЦикла; 
	
	Движения.РегистрВзаиморасчетов.Записывать=Истина;
	Движение = Движения.РегистрВзаиморасчетов.ДобавитьРасход();
	Движение.Период=Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = Материалы.Итог("Сумма");
КонецПроцедуры