// присваем переменные
Перем кНоменклатура;
Перем кЦена; 
Перем кЭлемент;
Перем кЭлемент1;
Перем кЭлемент2;
Перем кЭлемент3;
Перем кЭлемент4;

Функция ЗаполнитьНаСервере(ТабДок, Данные, ТекДок) Экспорт 
	ТабДок1 = Новый ТабличныйДокумент;
	ЗаполнитьПеременныеМодуля(Данные);
	ЕстьОшибки        = Ложь;
	ПрерватьПриОшибке = Данные.ПрерватьПриОшибке;
	
	МакетН = ПолучитьМакет("МакетНазначения");
	Заголовок = МакетН.ПолучитьОбласть("Заголовок");
	СтрокаН = МакетН.ПолучитьОбласть("Строка");
	ТабДок1.Вывести(Заголовок);            
	
	
	Колво = 0;
	Для К = Данные.НомерПервойСтроки По Данные.НомерПоследнейСтроки Цикл
		
		тНоменклатура                = ЗначениеЯчейки(ТабДок, К, кНоменклатура);
		тЦена 				 = ЗначениеЯчейкиН(ТабДок, К, кЦена);
		
		СсылкаНоменклатура = НайтиНоменклатуру(тНоменклатура);
		
		Если СсылкаНоменклатура = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = РегистрыСведений.ЦеныЩитов.СоздатьМенеджерЗаписи();
		НоваяЦена.Период = ТекущаяДата();
		НоваяЦена.Номенклатура = СсылкаНоменклатура;
		НоваяЦена.Цена = тЦена;
		
		НоваяЦена.Записать();
		
	КонецЦикла;    
	Возврат ТабДок1;
КонецФункции // ЗаполнитьНаСервере()

Функция ЗначениеЯчейки(ТабДок, Знач НомерСтроки, НомерКолонки)
	
	Если НомерКолонки = 0 Тогда
		Возврат "";
	КонецЕсли;
	НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
	
	Возврат ТабДок.Область(НомерСтроки, НомерКолонки).Текст;
	
КонецФункции // ЗначениеЯчейки()

Функция ЗначениеЯчейкиН(ТабДок, Знач НомерСтроки, НомерКолонки)
	
	Если НомерКолонки = 0 Тогда
		Возврат "";
	КонецЕсли;
	НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
	
	Возврат ТабДок.Область(НомерСтроки, 2).Текст;
	
КонецФункции // ЗначениеЯчейки()

Процедура ЗаполнитьПеременныеМодуля(Данные)
	
	кНоменклатура 	= Данные.Номенклатура;
	кЦена 	= Данные.Цена; 
	кЭлемент	= Данные.Элемент;
	кЭлемент1 	= Данные.Элемент1;
	кЭлемент2 	= Данные.Элемент2;
	кЭлемент3 	= Данные.Элемент3;
	кЭлемент4 	= Данные.Элемент4;
	
КонецПроцедуры

Функция НайтиНоменклатуру(ЗначениеПоля)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДеревянныеЩиты_Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование", ЗначениеПоля);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
   		Возврат Неопределено;
		
	ИначеЕсли Результат.Количество() > 0 Тогда
		
		Возврат Результат[0].Ссылка;
	Иначе
		НоваяНоменклатура = Справочники.ДеревянныеЩиты_Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.Наименование = ЗначениеПоля;
		НоваяНоменклатура.Записать();
		
		Возврат НоваяНоменклатура;
	КонецЕсли;
	
КонецФункции 


