
Процедура ПечатьДок(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДок)
	Макет = Документы.ПеремещениеТоваровМатериалов.ПолучитьМакет("ПечатьДок");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериалов.Дата,
	|	ПеремещениеТоваровМатериалов.Номер,
	|	ПеремещениеТоваровМатериалов.ОтветственноеЛицо,
	|	ПеремещениеТоваровМатериалов.Отправитель,
	|	ПеремещениеТоваровМатериалов.ПеремещениеМатериала,
	|	ПеремещениеТоваровМатериалов.ПеремещениеТовара,
	|	ПеремещениеТоваровМатериалов.Получатель,
	|	ПеремещениеТоваровМатериалов.МатериалыДляПеремещения.(
	|		НомерСтроки,
	|		Номенклатура_Материалов,
	|		КоличествоМатериалов,
	|		ЕдиницаИзмерения
	|	),
	|	ПеремещениеТоваровМатериалов.ТоварыДляПеремещения.(
	|		НомерСтроки,
	|		Номенклатура_Товаров,
	|		Количество,
	|		ЕдиницаИзмерения
	|	)
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов КАК ПеремещениеТоваровМатериалов
	|ГДЕ
	|	ПеремещениеТоваровМатериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМатериалыДляПеремещенияШапка = Макет.ПолучитьОбласть("МатериалыДляПеремещенияШапка");
	ОбластьМатериалыДляПеремещения = Макет.ПолучитьОбласть("МатериалыДляПеремещения");
	ОбластьТоварыДляПеремещенияШапка = Макет.ПолучитьОбласть("ТоварыДляПеремещенияШапка");
	ОбластьТоварыДляПеремещения = Макет.ПолучитьОбласть("ТоварыДляПеремещения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьМатериалыДляПеремещенияШапка);
		ВыборкаМатериалыДляПеремещения = Выборка.МатериалыДляПеремещения.Выбрать();
		Пока ВыборкаМатериалыДляПеремещения.Следующий() Цикл
			ОбластьМатериалыДляПеремещения.Параметры.Заполнить(ВыборкаМатериалыДляПеремещения);
			ТабДок.Вывести(ОбластьМатериалыДляПеремещения, ВыборкаМатериалыДляПеремещения.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТоварыДляПеремещенияШапка);
		ВыборкаТоварыДляПеремещения = Выборка.ТоварыДляПеремещения.Выбрать();
		Пока ВыборкаТоварыДляПеремещения.Следующий() Цикл
			ОбластьТоварыДляПеремещения.Параметры.Заполнить(ВыборкаТоварыДляПеремещения);
			ТабДок.Вывести(ОбластьТоварыДляПеремещения, ВыборкаТоварыДляПеремещения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
