
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	
	#Область ТабТовары
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериаловТовары.Номенклатура_Товаров,
	|	СУММА(ПеремещениеТоваровМатериаловТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов.ТоварыДляПеремещения КАК ПеремещениеТоваровМатериаловТовары
	|ГДЕ
	|	ПеремещениеТоваровМатериаловТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровМатериаловТовары.Номенклатура_Товаров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.Номенклатура_Товаров,
	|	ДокТЧ.Количество
	|ИЗ
	|	ДокТЧ КАК ДокТЧ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Товаров;
		Движение.Помещение = Отправитель;
		Движение.Количество = Выборка.Количество;	
	КонецЦикла;
	
	Движения.Записать();
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Отправитель И Номенклатура В (Выбрать ДокТЧ.Номенклатура_Товаров ИЗ ДокТЧ КАК ДокТЧ)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	РезультатЗапроса = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало товара "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыДляПеремещения Из ТоварыДляПеремещения Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТоварыДляПеремещения.Номенклатура_Товаров;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаТоварыДляПеремещения.Количество;
	КонецЦикла;
	#КонецОбласти

#Область ТабМатериалы 
 Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Номенклатура_Материалов,
	|	СУММА(ПеремещениеТоваровМатериаловМатериалыДляПеремещения.КоличествоМатериалов) КАК КоличествоМатериалов
	|ПОМЕСТИТЬ ТЧМат
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов.МатериалыДляПеремещения КАК ПеремещениеТоваровМатериаловМатериалыДляПеремещения
	|ГДЕ
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровМатериаловМатериалыДляПеремещения.Номенклатура_Материалов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧМат.Номенклатура_Материалов,
	|	ТЧМат.КоличествоМатериалов
	|ИЗ
	|	ТЧМат КАК ТЧМат";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура_Материалов;
		Движение.Помещение = Отправитель;
		Движение.Количество = Выборка.КоличествоМатериалов;
		
	КонецЦикла;
	
	Движения.Записать();
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиМатериаловИТоваровОстатки.Номенклатура,
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиМатериаловИТоваров.Остатки(&МоментВремени, Помещение = &Отправитель И Номенклатура В (Выбрать ТЧМат.Номенклатура_Материалов ИЗ ТЧМат КАК ТЧМат)) КАК ОстаткиМатериаловИТоваровОстатки
	 |ГДЕ
	 |	ОстаткиМатериаловИТоваровОстатки.КоличествоОстаток < 0";  
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	РезультатЗапроса = Запрос.Выполнить();	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			 Сообщить("Мало материалов "+ Выборка.Номенклатура +", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;	
	КонецЕсли;	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалыДляПеремещения Из МатериалыДляПеремещения Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалыДляПеремещения.Номенклатура_Материалов;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаМатериалыДляПеремещения.КоличествоМатериалов;
	КонецЦикла;



#КонецОбласти
	
	
	
КонецПроцедуры


