
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДокумент)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДокумент(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДокумент(ТабДок, ПараметрКоманды)
	Документы.ПереработкаСырья.ПечатьДокумент(ТабДок, ПараметрКоманды);
КонецПроцедуры
