&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	ОкончаниеОтчества= НРег(Прав(Объект.Отчество, 2));
	Если ОкончаниеОтчества = "на" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Женский");
	ИначеЕсли ОкончаниеОтчества = "ич" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Мужской");
	Иначе 
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура  ОбновитьФИО()
	   Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя,1)+"."+Лев(Объект.Отчество,1)+".";
КонецПроцедуры